import SocialImg from '/images/footer.png';

export default function Contacts() {
  return (
    <div className="">
      <div className="text-lg font-bold border-b border-[#333333] pb-6 w-full">Контакти</div>

      <div className="flex gap-3 mt-8 mb-6">

        <div
          className="w-[54px] h-[54px] rounded-full flex items-center justify-center"
          style={{
            background: `linear-gradient(180deg, #6559CA 0%, #BC318F 30%, #E33F5F 50%, #F77638 70%, #FEC66D 100%),
                radial-gradient(141.42% 141.42% at 100% 100%, #D9317A 0%, rgba(217, 49, 122, 0) 100%),
                radial-gradient(84.85% 169.71% at 60% -20%, #893DC2 0%, rgba(137, 61, 194, 0) 50%),
                radial-gradient(141.42% 141.42% at 100% -4950%, #893DC2 0%, rgba(137, 61, 194, 0) 50%),
                radial-gradient(113.14% 212.13% at 20% -50%, #5258CF 0%, rgba(82, 88, 207, 0) 50%),
                radial-gradient(141.42% 176.78% at -4950% -25%, #5258CF 0%, rgba(82, 88, 207, 0) 50%),
                radial-gradient(172.05% 172.05% at -4950% 140%, #FEC564 0%, rgba(254, 197, 100, 0) 50%),
                radial-gradient(111.02% 111.02% at 35% 90%, #FEC564 0%, rgba(254, 197, 100, 0) 50%)`
          }}
        >
          <svg width="21" height="21" viewBox="0 0 21 21" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fillRule="evenodd" clipRule="evenodd" d="M15.0599 0H5.73992C2.57493 0 0 2.57505 0 5.74005V15.06C0 18.2251 2.57493 20.8 5.73992 20.8H15.0599C18.2251 20.8 20.8001 18.225 20.8001 15.06V5.74005C20.8001 2.57505 18.2251 0 15.0599 0ZM18.9547 15.0622C18.9547 17.2098 17.2075 18.9568 15.06 18.9568H5.73988C3.59249 18.9569 1.84544 17.2098 1.84544 15.0622V5.74231C1.84544 3.59492 3.59249 1.84774 5.73988 1.84774H15.0598C17.2074 1.84774 18.9545 3.59492 18.9545 5.74231L18.9547 15.0622ZM5.04119 10.4037C5.04119 7.44836 7.44548 5.04408 10.4009 5.04408C13.3562 5.04408 15.7605 7.44836 15.7605 10.4037C15.7605 13.359 13.3562 15.7631 10.4009 15.7631C7.44548 15.7631 5.04119 13.359 5.04119 10.4037ZM10.4008 13.913C8.46316 13.913 6.88663 12.3367 6.88663 10.3991C6.88663 8.4613 8.46303 6.8849 10.4008 6.8849C12.3386 6.8849 13.915 8.4613 13.915 10.3991C13.915 12.3367 12.3385 13.913 10.4008 13.913ZM15.0294 3.87064C15.2805 3.61842 15.6298 3.47447 15.9853 3.47447C16.3421 3.47447 16.6915 3.61842 16.9425 3.87064C17.1947 4.12162 17.3387 4.47103 17.3387 4.82782C17.3387 5.18339 17.1947 5.5328 16.9425 5.78501C16.6903 6.036 16.3421 6.18117 15.9853 6.18117C15.6298 6.18117 15.2804 6.036 15.0294 5.78501C14.7772 5.5328 14.632 5.18351 14.632 4.82782C14.632 4.47103 14.777 4.12162 15.0294 3.87064Z" fill="white" />
          </svg>
        </div>

        <a href=""
          className="text-xl leading-5 underline font-medium max-w-[270px]"
        >У нас є крутий Instagram, в якому ми ділимося новинами IT. Приєднуйся!</a>
      </div>

      <img src={SocialImg} alt="image" className="w-full" />
    </div>
  )
}
