import type { StudyWayData } from "./StudyWays";

const b = import.meta.env.BASE_URL;

export const coursesCategories = [
  {
    id: "all",
    title: "ТОП НАПРЯМИ"
  },
  {
    id: "arbitrage",
    title: "Арбітраж трафіку"
  },
  {
    id: "ai-creator",
    title: "АІ-Штучний інтелект"
  },
  {
    id: "p2p-arbitrage",
    title: "P2P Арбітраж"
  },
  {
    id: "it-dev",
    title: "IT — Вхід у професію"
  },
  {
    id: "office",
    title: "Офісні програми"
  },
];

export const courses = [
  {
    id: "arbitrage",
    title: "Курс з арбітражу трафіку iGaming",
    description: "Навчишся запускати рекламу та заробляти на трафіку без програмування. Підійде для старту з нуля.",
    tags: ["Nutra", "Facebook", "Google", "iGaming"],
    video: `${import.meta.env.BASE_URL}video/iGambling.mp4`
  },
  {
    id: "p2p-arbitrage",
    title: "Курс P2P Арбітраж",
    description: "Навчишся",
    tags: ["Binance", "USDT", "Сrypto", "Exchange"],
    video: `${import.meta.env.BASE_URL}video/p2p.mp4`
  },
  {
    id: "arbitrage",
    title: "Курс з арбітражу трафіку Nutra",
    description: "Навчишся",
    tags: ["Nutra", "Facebook"],
    video: `${import.meta.env.BASE_URL}video/nutra.mp4`
  },
  {
    id: "ai-creator",
    title: "Курс AI-креатор для арбітражу",
    description: "Навчишся",
    tags: ["AI", "IT-напрямок"],
    video: `${import.meta.env.BASE_URL}video/ai-creator.mp4`
  },
  {
    id: "arbitrage",
    title: "Курс Універсальній Арбітражник",
    description: "Навчишся",
    tags: ["VIP", "iGaming", "Crypto", "Exchange"],
    video: `${import.meta.env.BASE_URL}video/universal.mp4`
  },
  {
    id: "ai-creator",
    title: "Курс створення сайтів за допомогою AI",
    description: "Навчишся",
    tags: ["AI", "IT-напрямок",],
    video: `${import.meta.env.BASE_URL}video/ai-dev.mp4`
  },
];

export const explaners = [
  {
    title: <>Фокус на<br /> результат і дохід</>,
    description: <>Ми навчаємо з чіткою метою — підготувати тебе до реальної роботи та перших грошей.<br />Формат: 20% теорії, 80% практики на реальних завданнях.</>,
    image: `${import.meta.env.BASE_URL}images/explaner-1.png`,
  },
  {
    title: <>Практики ринку<br /> — твої ментори</>,
    description: <>Тебе супроводжують експерти, які працюють у сфері прямо зараз.<br />Вони допомагають розібратися в темах, виправляють помилки та проводять живі Q&A-сесії</>,
    image: `${import.meta.env.BASE_URL}images/explaner-2.png`,
  },
  {
    title: <>Платформа, а якій<br />  є все</>,
    description: <>Відеоуроки, практика, завдання та прогрес — все в одному місці.<br />Навчаєшся у зручному темпі та одразу застосовуєш знання на практиці.</>,
    image: `${import.meta.env.BASE_URL}images/explaner-3.png`,
  },
];

export const faq = [
  {
    title: "Як відбувається навчання на платформі?",
    text: "Навчання проходить онлайн у зручному форматі. Доступ до відеоуроків, практичних завдань та матеріалів відкривається після реєстрації. Навчатися можна у власному темпі, з підтримкою команди платформи."
  },
  {
    title: "Чи можна сплатити курси з частинами?",
    text: "Так, доступна оплата частинами. Умови обговорюються після залишення заявки."
  },
  {
    title: "Чи можна навчатися без технічного бекграунду?",
    text: "Так. Курси розраховані на навчання з нуля і не потребують попереднього технічного або IT-досвіду."
  },
  {
    title: "Чи отримаю я сертифікат або диплом?",
    text: "Так, після завершення курсу видається сертифікат про проходження навчання."
  },
  {
    title: "Як отримати безкоштовну консультацію?",
    text: "Потрібно залишити заявку на сайті. Менеджер зв’яжеться для консультації."
  },
];

export const studyWays: StudyWayData[] = [
  {
    id: "couches",
    category: "Досвідчені коучі",
    title: "Даємо детальний фідбек",
    description: <>Кожну твою роботу перевіряє куратор-практик з реальним досвідом.<br /> Ти отримуєш зрозумілий розбір: що вже добре, що варто покращити і як саме це зробити на практиці — без складних термінів і «води»</>,
    img: `${b}images/study-1.jpg`,
  },
  {
    id: "warranty",
    category: "Гарантія працевлаштування",
    title: "Гарантія працевлашутвання",
    description: <>Ми співпрацюємо з командами та проєктами на ринку арбітражу, P2P та digital-напрямків, які зацікавлені у підготовлених спеціалістах.<br />Під час навчання ти отримуєш практичні навички та працюєш з реальними інструментами, а після завершення курсу ми допомагаємо з виходом на ринок: рекомендаціями, підготовкою до співбесід та передачею кандидатів партнерам.</>,
    video: `${b}video/study-2.mp4`,
  },
  {
    id: "comunity",
    category: "Ком'юніті",
    title: "Комьюніті",
    description: <>Ми співпрацюємо з командами та проєктами на ринку арбітражу, P2P та digital-напрямків, які зацікавлені у підготовлених спеціалістах.<br />Під час навчання ти отримуєш практичні навички та працюєш з реальними інструментами, а після завершення курсу ми допомагаємо з виходом на ринок: рекомендаціями, підготовкою до співбесід та передачею кандидатів партнерам.</>,
    video: `${b}video/study-3.mp4`,
  }
];